[
  {
    "index": 1,
    "voiceover": "你出生在公元前100年的古罗马，属于朱利亚家族，一个自称与爱神维纳斯有血缘关系的显赫家族。你从小就在荣耀与压力中成长。",
    "image": "A bustling scene of ancient Rome, with grand architecture, market streets, and a noble family emblem with Venus's image prominently displayed."
  },
  {
    "index": 2,
    "voiceover": "你的父亲是亚洲行省的总督，在罗马政坛上有些地位，但家族的财富和影响力逐渐衰退，你被寄予厚望，要让家族重回巅峰。",
    "image": "A Roman governor in a toga addressing a crowd, a young boy watching intently in the background, symbolizing the passing of legacy."
  },
  {
    "index": 3,
    "voiceover": "15岁时，你的父亲去世了，留下了巨额遗产和你母亲的支持。你成为家族的唯一希望，开始为家族崛起而努力。",
    "image": "A young Roman teenager in mourning attire, standing beside his mother, with a grand Roman villa in the background."
  },
  {
    "index": 4,
    "voiceover": "16岁，你与科内利亚结婚，这本是一次政治联姻，但你们意外地彼此相爱。3年后，你因拒绝离婚而被独裁者苏拉追杀。",
    "image": "A dramatic Roman wedding scene, with strategic alliances symbolized by influential figures in the background; the couple shares a genuine, loving glance."
  },
  {
    "index": 5,
    "voiceover": "18岁，你成为通缉犯，逃亡罗马乡间，靠家族的支持和维斯塔贞女的帮助才得以被赦免，随后你前往亚洲行省投身军旅。",
    "image": "A young Roman fugitive running through lush countryside, with soldiers in pursuit and a temple of Vesta in the distance."
  },
  {
    "index": 6,
    "voiceover": "20岁，你完成外交任务，为罗马军队争取到舰队，成功平息米蒂利尼叛乱。这次功绩让你赢得了罗马的荣誉——公民冠。",
    "image": "A triumphant young Caesar standing on a ship, holding a civic crown, with Roman soldiers cheering around him."
  },
  {
    "index": 7,
    "voiceover": "苏拉去世后，你回到罗马，开始通过演讲和政坛活动提升影响力，并逐渐崭露头角，最终成为庞大的罗马祭司长。",
    "image": "A charismatic Caesar addressing a crowd at the Roman Forum, with monuments and cheering citizens in the background."
  },
  {
    "index": 8,
    "voiceover": "你与庞培和克拉苏组成了秘密联盟“前三头同盟”，通过权谋和资源共享，你成功当选为罗马执政官，家族荣耀重现。",
    "image": "Caesar, Pompey, and Crassus in a secretive meeting, surrounded by maps and symbols of wealth, military, and political power."
  },
  {
    "index": 9,
    "voiceover": "担任执政官后，你获得了高卢等资源丰富地区的治理权，从公元前58年开始，你以军事行动征服了整个高卢。",
    "image": "Caesar leading Roman legions into battle in Gaul, with dramatic landscapes and tribal warriors in the background."
  },
  {
    "index": 10,
    "voiceover": "你的军事胜利让你富有且拥有忠诚的军队，但也引发了元老院的恐惧。他们要求你解散军队回罗马，你拒绝了。",
    "image": "Caesar receiving a scroll from a Roman senator, surrounded by loyal legionaries, with a determined expression on his face."
  },
  {
    "index": 11,
    "voiceover": "公元前49年，你跨越卢比孔河，公开向罗马宣战，迅速击败庞培的军队，将内战引向高潮。",
    "image": "Caesar on horseback, crossing the Rubicon River at sunrise, with legions marching behind him, symbolizing an irreversible decision."
  },
  {
    "index": 12,
    "voiceover": "庞培在法萨卢斯战役中被击败，逃往埃及，但最终被杀害。你面对他的头颅感慨权力的代价，继续清除政敌。",
    "image": "A somber Caesar holding a Roman general's helmet, looking at Pompey's severed head presented on a platter in an Egyptian palace."
  },
  {
    "index": 13,
    "voiceover": "公元前46年，你平定内战，被元老院任命为十年独裁者，随后又在公元前44年被宣布为终身独裁者。",
    "image": "Caesar in a purple toga, sitting on a golden throne, surrounded by senators and Roman citizens, with laurel wreaths and banners."
  },
  {
    "index": 14,
    "voiceover": "你改革罗马，为平民减税、赦免债务，但元老院中的旧势力却视你为威胁，策划了刺杀行动。",
    "image": "Caesar addressing the Senate, with shadowy figures in the background exchanging conspiratorial glances."
  },
  {
    "index": 15,
    "voiceover": "公元前44年3月15日，你在元老院被刺杀。你虽死于阴谋，但朱利亚家族的名字永垂不朽。",
    "image": "The tragic scene of Caesar's assassination, blood pooling on the Senate floor, with Pompey's statue looming in the background."
  }
]