[
  {
    "index": 1,
    "voiceover": "清晨的阳光洒满餐桌，满口肉坐下享用他的牛排早餐，开始思考孩子的名字。",
    "image": "A cozy morning scene with sunlight streaming through a window, a man enjoying a hearty breakfast of steak, eggs, and sausage at a wooden table."
  },
  {
    "index": 2,
    "voiceover": "满口肉心里想着：我希望我的孩子能有自由的灵魂，像风一样无拘无束！",
    "image": "A man deep in thought, holding a fork with a sausage, while a dreamy expression suggests he's imagining freedom and the open skies."
  },
  {
    "index": 3,
    "voiceover": "他开始盘旋各种名字，却一个个否定：风儿、云朵、自由……都不太合适。",
    "image": "A whimsical depiction of floating words like '风儿,' '云朵,' and '自由' in colorful thought bubbles as the man scratches his head."
  },
  {
    "index": 4,
    "voiceover": "邻居家的小狗“自由”跑过来，满嘴泥土，给满口肉带来了新灵感。",
    "image": "A playful dog covered in dirt running towards a man sitting at a table, wagging its tail energetically."
  },
  {
    "index": 5,
    "voiceover": "满口肉笑着说：不如叫‘泥土’，孩子能扎根大地！",
    "image": "A humorous scene where the man, smiling broadly, imagines a child sprouting like a plant from the soil, surrounded by greenery."
  },
  {
    "index": 6,
    "voiceover": "满口肉灵光一闪，又想到了‘风筝’，但妻子一针见血地指出了问题。",
    "image": "A comical illustration of a kite flying high in the sky with a string tied to the ground, and a woman looking unimpressed with her arms crossed."
  },
  {
    "index": 7,
    "voiceover": "他边走向厨房边想着：要不直接叫‘肉肉’，听起来多亲切！",
    "image": "A man walking towards a kitchen, still holding a piece of meat, with the word '肉肉' humorously floating above his head."
  },
  {
    "index": 8,
    "voiceover": "妻子终于忍不住吐槽：孩子是人，不是狗，更不是风筝和肉！",
    "image": "A woman with an exasperated expression, gesturing dramatically as the man looks sheepish, holding a plate of food."
  },
  {
    "index": 9,
    "voiceover": "最终，满口肉决定叫‘自由肉’，既有自由的灵魂，又有肉的元素！",
    "image": "A lighthearted scene of the man confidently declaring the name '自由肉,' with a playful sparkle in his eyes and a smiling baby imagined in the background."
  },
  {
    "index": 10,
    "voiceover": "在欢声笑语中，他们迎来了孩子的出生，成为小区最有创意的父母。",
    "image": "A cheerful family scene with parents smiling at their newborn, surrounded by neighbors laughing and congratulating them."
  }
]